{
    "requests": [
        {
            "reqUsername": "nmajid",
            "genre": "comics",
            "title": "Some Random Comic",
            "author": [
                "Quimchee"
            ],
            "illustrator": [
                "--"
            ],
            "desc": "Here's the description",
            "url": "https:\/\/www.webtoons.com\/en\/drama\/i-love-yoo\/list?title_no=986&page=1",
            "image_url": "",
            "rating": "5",
            "reviews": []
        },
        {
            "reqUsername": "nmajid",
            "genre": "comics",
            "title": "New Comic",
            "author": [
                "Author 1",
                " Author 2"
            ],
            "illustrator": [
                "Illustrator 1",
                " Illustrator 2"
            ],
            "desc": "Something",
            "url": "https:\/\/www.webtoons.com\/en\/",
            "rating": "5",
            "reviews": []
        },
        {
            "reqUsername": "user1",
            "genre": "fiction",
            "title": "The Time Keeper",
            "author": [
                "Mitch Albom"
            ],
            "illustrator": [
                ""
            ],
            "desc": "The inventor of the world's first clock is punished for trying to measure God's greatest gift. He is banished to a cave for centuries and forced to listen to the voices of all who come after him seeking more days, more years. Eventually, with his soul nearly broken, Father Time is granted his freedom, along with a magical hourglass and a mission: a chance to redeem himself by teaching two earthly people the true meaning of time.\r\n\r\nHe returns to our world - now dominated by the hour-counting he so innocently began - and commences a journey with two unlikely partners: one a teenage girl who is about to give up on life, the other a wealthy old businessman who wants to live forever. To save himself, he must save them both. And stop the world to do so. ",
            "url": "https:\/\/www.goodreads.com\/book\/show\/13624688-the-time-keeper",
            "image_url": "",
            "rating": "5",
            "reviews": []
        },
        {
            "reqUsername": "user1",
            "genre": "fiction",
            "title": "The Kite Runner",
            "author": [
                "Khaled Hosseini"
            ],
            "illustrator": [
                ""
            ],
            "desc": "The unforgettable, heartbreaking story of the unlikely friendship between a wealthy boy and the son of his father’s servant, The Kite Runner is a beautifully crafted novel set in a country that is in the process of being destroyed. It is about the power of reading, the price of betrayal, and the possibility of redemption; and an exploration of the power of fathers over sons—their love, their sacrifices, their lies.\r\n\r\nA sweeping story of family, love, and friendship told against the devastating backdrop of the history of Afghanistan over the last thirty years, The Kite Runner is an unusual and powerful novel that has become a beloved, one-of-a-kind classic. ",
            "url": "https:\/\/www.goodreads.com\/book\/show\/77203.The_Kite_Runner",
            "image_url": "",
            "rating": "5",
            "reviews": []
        },
        {
            "reqUsername": "user1",
            "genre": "other",
            "title": "The Ladies' Paradise",
            "author": [
                " Émile Zola",
                " Robin Buss (Translator)",
                " Brian Nelson (Translator)"
            ],
            "illustrator": [
                ""
            ],
            "desc": " The Ladies Paradise (Au Bonheur des Dames) recounts the rise of the modern department store in late nineteenth-century Paris. The store is a symbol of capitalism, of the modern city, and of the bourgeois family: it is emblematic of changes in consumer culture, and the changes in sexual attitudes and class relations taking place at the end of the century. This new translation of the eleventh novel in Zola's Rougon-Macquart cycle captures the spirit of one of his greatest works.",
            "url": "https:\/\/www.goodreads.com\/book\/show\/28413.The_Ladies_Paradise",
            "image_url": "",
            "rating": "5",
            "reviews": []
        }
    ]
}