{
    "requests": [
        {
            "reqUsername": "nmajid",
            "genre": "comics",
            "title": "Some Random Comic",
            "author": [
                "Quimchee"
            ],
            "illustrator": [
                "--"
            ],
            "desc": "Here's the description",
            "url": "https:\/\/www.webtoons.com\/en\/drama\/i-love-yoo\/list?title_no=986&page=1",
            "image_url": "",
            "rating": "5",
            "reviews": []
        },
        {
            "reqUsername": "nmajid",
            "genre": "comics",
            "title": "New Comic",
            "author": [
                "Author 1",
                " Author 2"
            ],
            "illustrator": [
                "Illustrator 1",
                " Illustrator 2"
            ],
            "desc": "Something",
            "url": "https:\/\/www.webtoons.com\/en\/",
            "rating": "5",
            "reviews": []
        },
        {
            "reqUsername": "iberrada",
            "genre": "fiction",
            "title": "To Kill a Mockingbird",
            "author": [
                "Harper Lee"
            ],
            "illustrator": [
                ""
            ],
            "desc": " The unforgettable novel of a childhood in a sleepy Southern town and the crisis of conscience that rocked it. \"To Kill A Mockingbird\" became both an instant bestseller and a critical success when it was first published in 1960. It went on to win the Pulitzer Prize in 1961 and was later made into an Academy Award-winning film, also a classic.\r\n\r\nCompassionate, dramatic, and deeply moving, \"To Kill A Mockingbird\" takes readers to the roots of human behavior - to innocence and experience, kindness and cruelty, love and hatred, humor and pathos. Now with over 18 million copies in print and translated into forty languages, this regional story by a young Alabama woman claims universal appeal. Harper Lee always considered her book to be a simple love story. Today it is regarded as a masterpiece of American literature.",
            "url": "https:\/\/www.goodreads.com\/book\/show\/2657.To_Kill_a_Mockingbird",
            "image_url": "",
            "rating": "5",
            "reviews": []
        },
        {
            "reqUsername": "iberrada",
            "genre": "sci-fi",
            "title": "The Hunger Games",
            "author": [
                "Suzanne Collins"
            ],
            "illustrator": [
                ""
            ],
            "desc": "In the ruins of a place once known as North America lies the nation of Panem, a shining Capitol surrounded by twelve outlying districts. The Capitol is harsh and cruel and keeps the districts in line by forcing them all to send one boy and one girl between the ages of twelve and eighteen to participate in the annual Hunger Games, a fight to the death on live TV.\r\n\r\nSixteen-year-old Katniss Everdeen, who lives alone with her mother and younger sister, regards it as a death sentence when she steps forward to take her sister's place in the Games. But Katniss has been close to dead before—and survival, for her, is second nature. Without really meaning to, she becomes a contender. But if she is to win, she will have to start making choices that weight survival against humanity and life against love. ",
            "url": "https:\/\/www.goodreads.com\/book\/show\/2767052-the-hunger-games",
            "image_url": "",
            "rating": "5",
            "reviews": []
        }
    ]
}