{
    "users": [
        {
            "name": "Nukhbah Majid",
            "email": "nmajid@smith.edu",
            "type": "admin",
            "username": "nmajid",
            "password": "adminuser",
            "readingList": [
                [
                    "1111",
                    "Superman Archives, Vol. 2",
                    "Not-Started"
                ]
            ]
        },
        {
            "name": "Imane Berrada",
            "email": "iberrada@smith.edu",
            "username": "iberrada",
            "type": "admin",
            "password": "adminuser",
            "readingList": [
                [
                    "1124",
                    "The Ladies' Paradise",
                    "In-progress"
                ],
                [
                    "1113",
                    "Daredevil (1964-1998) #1",
                    "Not-Started"
                ]
            ],
            "myBooks": [
                {
                    "bookid": "1121",
                    "genre": "romance",
                    "title": "Pride and Prejudice",
                    "author": [
                        " Jane Austen",
                        " Anna Quindlen"
                    ],
                    "illustrator": [
                        ""
                    ],
                    "description": " Since its immediate success in 1813, Pride and Prejudice has remained one of the most popular novels in the English language. Jane Austen called this brilliant work \"her own darling child\" and its vivacious heroine, Elizabeth Bennet, \"as delightful a creature as ever appeared in print.\" The romantic clash between the opinionated Elizabeth and her proud beau, Mr. Darcy, is a splendid performance of civilized sparring. And Jane Austen's radiant wit sparkles as her characters dance a delicate quadrille of flirtation and intrigue, making this book the most superb comedy of manners of Regency England.",
                    "url": "https:\/\/www.goodreads.com\/book\/show\/1885.Pride_and_Prejudice",
                    "image_url": "",
                    "rating": "5",
                    "reviews": []
                },
                {
                    "bookid": "1122",
                    "genre": "sci-fi",
                    "title": "The Hunger Games",
                    "author": [
                        "Suzanne Collins"
                    ],
                    "illustrator": [
                        ""
                    ],
                    "description": "In the ruins of a place once known as North America lies the nation of Panem, a shining Capitol surrounded by twelve outlying districts. The Capitol is harsh and cruel and keeps the districts in line by forcing them all to send one boy and one girl between the ages of twelve and eighteen to participate in the annual Hunger Games, a fight to the death on live TV.\r\n\r\nSixteen-year-old Katniss Everdeen, who lives alone with her mother and younger sister, regards it as a death sentence when she steps forward to take her sister's place in the Games. But Katniss has been close to dead before—and survival, for her, is second nature. Without really meaning to, she becomes a contender. But if she is to win, she will have to start making choices that weight survival against humanity and life against love. ",
                    "url": "https:\/\/www.goodreads.com\/book\/show\/2767052-the-hunger-games",
                    "image_url": "",
                    "rating": "5",
                    "reviews": []
                },
                {
                    "bookid": "1123",
                    "genre": "fiction",
                    "title": "To Kill a Mockingbird",
                    "author": [
                        "Harper Lee"
                    ],
                    "illustrator": [
                        ""
                    ],
                    "description": " The unforgettable novel of a childhood in a sleepy Southern town and the crisis of conscience that rocked it. \"To Kill A Mockingbird\" became both an instant bestseller and a critical success when it was first published in 1960. It went on to win the Pulitzer Prize in 1961 and was later made into an Academy Award-winning film, also a classic.\r\n\r\nCompassionate, dramatic, and deeply moving, \"To Kill A Mockingbird\" takes readers to the roots of human behavior - to innocence and experience, kindness and cruelty, love and hatred, humor and pathos. Now with over 18 million copies in print and translated into forty languages, this regional story by a young Alabama woman claims universal appeal. Harper Lee always considered her book to be a simple love story. Today it is regarded as a masterpiece of American literature.",
                    "url": "https:\/\/www.goodreads.com\/book\/show\/2657.To_Kill_a_Mockingbird",
                    "image_url": "",
                    "rating": "5",
                    "reviews": []
                }
            ]
        },
        {
            "name": "Mariem Snoussi",
            "email": "msnoussi@smith.edu",
            "username": "msnoussi",
            "type": "admin",
            "password": "adminuser",
            "readingList": []
        },
        {
            "name": "User 1",
            "email": "user1@gmail.com",
            "username": "user1",
            "type": "user",
            "password": "user1",
            "readingList": [
                [
                    "1112",
                    "Star Trek: Waypoint #2",
                    "Completed"
                ]
            ],
            "myBooks": [
                {
                    "bookid": "1124",
                    "genre": "other",
                    "title": "The Ladies' Paradise",
                    "author": [
                        " Émile Zola",
                        " Robin Buss (Translator)",
                        " Brian Nelson (Translator)"
                    ],
                    "illustrator": [
                        ""
                    ],
                    "description": " The Ladies Paradise (Au Bonheur des Dames) recounts the rise of the modern department store in late nineteenth-century Paris. The store is a symbol of capitalism, of the modern city, and of the bourgeois family: it is emblematic of changes in consumer culture, and the changes in sexual attitudes and class relations taking place at the end of the century. This new translation of the eleventh novel in Zola's Rougon-Macquart cycle captures the spirit of one of his greatest works.",
                    "url": "https:\/\/www.goodreads.com\/book\/show\/28413.The_Ladies_Paradise",
                    "image_url": "",
                    "rating": "5",
                    "reviews": []
                },
                {
                    "bookid": "1125",
                    "genre": "fiction",
                    "title": "The Time Keeper",
                    "author": [
                        "Mitch Albom"
                    ],
                    "illustrator": [
                        ""
                    ],
                    "description": "The inventor of the world's first clock is punished for trying to measure God's greatest gift. He is banished to a cave for centuries and forced to listen to the voices of all who come after him seeking more days, more years. Eventually, with his soul nearly broken, Father Time is granted his freedom, along with a magical hourglass and a mission: a chance to redeem himself by teaching two earthly people the true meaning of time.\r\n\r\nHe returns to our world - now dominated by the hour-counting he so innocently began - and commences a journey with two unlikely partners: one a teenage girl who is about to give up on life, the other a wealthy old businessman who wants to live forever. To save himself, he must save them both. And stop the world to do so. ",
                    "url": "https:\/\/www.goodreads.com\/book\/show\/13624688-the-time-keeper",
                    "image_url": "",
                    "rating": "5",
                    "reviews": []
                }
            ]
        },
        {
            "name": "user2",
            "email": "user2@gmail.com",
            "username": "User 2",
            "type": "user",
            "password": "user2",
            "readingList": [
                [
                    "1120",
                    "The Space Between Worlds",
                    "In-progress"
                ]
            ],
            "myBooks": [
                {
                    "bookid": "1126",
                    "genre": "fiction",
                    "title": "The Kite Runner",
                    "author": [
                        "Khaled Hosseini"
                    ],
                    "illustrator": [
                        ""
                    ],
                    "description": "The unforgettable, heartbreaking story of the unlikely friendship between a wealthy boy and the son of his father’s servant, The Kite Runner is a beautifully crafted novel set in a country that is in the process of being destroyed. It is about the power of reading, the price of betrayal, and the possibility of redemption; and an exploration of the power of fathers over sons—their love, their sacrifices, their lies.\r\n\r\nA sweeping story of family, love, and friendship told against the devastating backdrop of the history of Afghanistan over the last thirty years, The Kite Runner is an unusual and powerful novel that has become a beloved, one-of-a-kind classic. ",
                    "url": "https:\/\/www.goodreads.com\/book\/show\/77203.The_Kite_Runner",
                    "image_url": "",
                    "rating": "5",
                    "reviews": []
                }
            ]
        },
        {
            "name": "Imane ",
            "email": "testEmail@gmail.com",
            "username": "Imane",
            "type": "user",
            "password": "imane",
            "readingList": [
                [
                    "1112",
                    "Star Trek: Waypoint #2",
                    "Completed"
                ],
                [
                    "1116",
                    "Anne Frank",
                    "In-progress"
                ],
                [
                    "1119",
                    "The Jane Austen Society",
                    "Not-Started"
                ]
            ]
        },
        {
            "name": "User3",
            "email": "user3@gmail.com",
            "username": "Lily",
            "type": "user",
            "password": "pass",
            "readingList": [
                [
                    "1111",
                    "Superman Archives, Vol. 2",
                    "Not-Started"
                ]
            ]
        },
        {
            "name": "new",
            "email": "newUser2@gmail.com",
            "username": "de",
            "type": "user",
            "password": "de",
            "readingList": []
        }
    ]
}